<template>
    <main class="main-material">
        <div class="container">
            <div class="title">
                Правило “открытой руки”.
                Подача блюда/напитки
                гостю по этикету.
            </div>
            <div class="image">
                <img :src="require('@/assets/uploads/material-image.png')">
            </div>
            <section class="desc">
                <div class="desc-title">
                    Описание курса
                </div>
                <p class="desc-text">
                    Открывая ресторанный бизнес, Вы можете идти по пути инвестиции денег в проект, создаваемый «с нуля», а можете купить уже кем-то сделанный, налаженный ресторан. В мировой практике – сначала создать идею, а потом уже подыскать для неё помещение.

                    Обратитесь к услугам специалистов. Они проведут полное профессиональное исследование. А именно: изучат соответствующие параметры:

                    а) потоки людей в непосредственной близости от помещения, т.е. выяснят приблизительную структуру и платежеспособность потенциальных клиентов

                    б) конкурентное окружение. То есть изучат конкурентов, их концепции, дизайн, посещаемость, клиентов, работу персонала и «средний чек».

                    в) основные здания и сооружения вблизи будущего ресторана,

                    г) удобство подъезда, наличие парковки,

                    д) возможности внешнего оформления;

                    Проведение такого исследования специалистами обойдется в 3-5 тысяч зелёных рублей. Бизнес-план на два года -- в 500 долларов. Имея подобное маркетинговое исследование, ошибиться почти невозможно.
                </p>
            </section>
        </div>
    </main>
</template>

<script>
    export default {
        name: "MainMaterial"
    }
</script>

<style scoped>

.container {
    padding-left: 16px;
    padding-right: 16px;
}

.title {
    margin-top: 32px;
    line-height: 30px;
    letter-spacing: 0.04px;
    color: #000000;
    font-weight: 300;
    font-size: 24px;
}

.image {
    margin-top: 10px;
    width: 100%;
    height: auto;
    display: flex;
}

.image img {
    width: 100%;
    height: auto;
}

.desc {
    margin-top: 10px;
}

.desc-text {
    font-size: 14px;
    line-height: 22px;
    letter-spacing: -0.078px;
    color: #4B4B4B;
}
</style>