<template>
    <v-ons-page class="test" ref="test">
        <StickyHeader :title="'вопрос ' + $route.params.id + ' из 3'"
                :color="'green'"
                :title-uppercase="true"
        >
        </StickyHeader>
        <main>
            <MainTest :tests="tests"></MainTest>
        </main>
    </v-ons-page>
</template>

<script>
    import StickyHeader from "../components/StickyHeader";
    import MainTest from "../components/Test/MainTest";
    export default {
        name: "Test",
        components: {MainTest, StickyHeader},
        data () {
            return {
                tests: [
                    {
                        type: 'default',
                        answers: [
                            {
                                id: 0,
                                text: 'Приборы для первого блюда кладут дальше всего от тарелки гостя, приборы для последующих блюд кладут один за другим ближе к тарелке',
                                desc: 'Сюда же входят поведенческие паттерны, коммуникационные ответы на вопросы команды, и постоянная внутренняя связь с ней.'
                            },
                            {
                                id: 1,
                                text: 'Приборы для первого блюда кладут ближе всего к тарелке гостя, приборы для последующих блюд кладут один за другим дальше от тарелки',
                                desc: 'Сюда же входят поведенческие паттерны, коммуникационные ответы на вопросы команды, и постоянная внутренняя связь с ней.'
                            },
                            {
                                id: 2,
                                text: 'Приборы для первого блюда кладут ближе всего к тарелке гостя, приборы для последующих блюд кладут один за другим дальше от тарелки',
                                desc: 'Сюда же входят поведенческие паттерны, коммуникационные ответы на вопросы команды, и постоянная внутренняя связь с ней.'
                            }
                        ],
                        correctAnswer: 0,
                        question: 'Как правильно раскладывать приборы?'
                    },
                    {
                        type: 'multi',
                        question: 'Как правильно раскладывать приборы?',
                        answers: [
                            {
                                id: 0,
                                text: 'Приборы для первого блюда кладут дальше всего от тарелки гостя, приборы для последующих блюд кладут один за другим ближе к тарелке',
                                desc: 'Сюда же входят поведенческие паттерны, коммуникационные ответы на вопросы команды, и постоянная внутренняя связь с ней.'
                            },
                            {
                                id: 1,
                                text: 'Приборы для первого блюда кладут ближе всего к тарелке гостя, приборы для последующих блюд кладут один за другим дальше от тарелки',
                                desc: 'Сюда же входят поведенческие паттерны, коммуникационные ответы на вопросы команды, и постоянная внутренняя связь с ней.'
                            },
                            {
                                id: 2,
                                text: 'Приборы для первого блюда кладут ближе всего к тарелке гостя, приборы для последующих блюд кладут один за другим дальше от тарелки',
                                desc: 'Сюда же входят поведенческие паттерны, коммуникационные ответы на вопросы команды, и постоянная внутренняя связь с ней.'
                            }
                        ],
                        video: "http://techslides.com/demos/sample-videos/small.mp4",
                        correctAnswer: [0, 1]
                    },
                    {
                        type: 'another',
                        question: 'Как правильно раскладывать приборы?',
                        answers: [
                            {
                                id: 0,
                                text: 'Приборы для первого блюда кладут дальше всего от тарелки гостя, приборы для последующих блюд кладут один за другим ближе к тарелке',
                                desc: 'Сюда же входят поведенческие паттерны, коммуникационные ответы на вопросы команды, и постоянная внутренняя связь с ней.'
                            },
                            {
                                id: 1,
                                text: 'Приборы для первого блюда кладут ближе всего к тарелке гостя, приборы для последующих блюд кладут один за другим дальше от тарелки',
                                desc: 'Сюда же входят поведенческие паттерны, коммуникационные ответы на вопросы команды, и постоянная внутренняя связь с ней.'
                            },
                            {
                                id: 2,
                                text: 'Приборы для первого блюда кладут ближе всего к тарелке гостя, приборы для последующих блюд кладут один за другим дальше от тарелки',
                                desc: 'Сюда же входят поведенческие паттерны, коммуникационные ответы на вопросы команды, и постоянная внутренняя связь с ней.'
                            }
                        ],
                        picture: "https://www.hotel-grandium.cz/files/hotel/dining/Winter_Garden_127.jpg",
                        correctAnswer: [0, 'test']
                    }
                ]
            }
        }
    }
</script>

<style scoped>
main {
    padding-top: 43px;
    padding-bottom: 80px;
    margin-top: env(safe-area-inset-top);
}
</style>